{"posts":[{"title":"Screen Recorder Privacy policy","text":"Screen Recorder respects and protects the personal privacy of all users of the Services. In order to provide you with a more accurate and personalized service, Screen Recorder may use and disclose your personal information as set forth in this Privacy Policy. However, Screen Recorder will treat this information with a high degree of diligence and duty of care. Screen Recorder will not disclose or provide this information to third parties without your prior consent, except as provided in this Privacy Policy, which may be updated from time to time. By agreeing to the Screen Recorder Service Use Agreement, you are deemed to have agreed to this Privacy Policy in its entirety. This Privacy Policy is an integral part of the Screen Recorder Service Use Agreement. Use of Informationa) Screen Recorder will not provide, sell, rent, share or trade your personal information to any unrelated third party without your prior permission or unless such third party and Screen Recorder (including Screen Recorder affiliates) are providing services to you, either individually or jointly, and after such services have ended, it will be prohibited from accessing all such information, including all that it previously had access to. b) b) Screen Recorder also does not allow any third party to collect, edit, sell, or distribute your personal information by any means without compensation. Screen Recorder reserves the right to immediately terminate the service agreement with any Screen Recorder platform user who engages in any of the above activities upon discovery. c) Screen Recorder may use your personal information to provide you with information that may be of interest to you for the purposes of serving you as a user, including but not limited to sending you information about products and services, or sharing information with Screen Recorder partners so that they may send you information about their products and services (the latter of which requires your prior consent). Disclosure of InformationScreen Recorder will disclose your personal information, in whole or in part, based on your personal wishes or as required by law in the following circumstances. a) to third parties with your prior consent. b) must share your personal information with third parties in order to provide the products and services you have requested. c) to a third party or an administrative or judicial body, in accordance with the relevant provisions of the law, or at the request of an administrative or judicial body. d) You are required to disclose to a third party if you violate any relevant Chinese law or regulation or the Screen Recorder Service Agreement or related rules. e) if you are a qualified IP complainant and have filed a complaint, disclose to the Respondent, at the Respondent’s request, so that both parties can address any potential rights disputes. f) If any party to a transaction created on the Screen Recorder platform performs or partially performs its obligations under the transaction and requests disclosure, Screen Recorder reserves the right, at its discretion, to provide the user with the contact information of its counterparty, as necessary to facilitate the completion of the transaction or the resolution of a dispute. g) Other disclosures that Screen Recorder deems appropriate by law, regulation or site policy. Storage and Exchange of InformationScreen Recorder does not collect any user information. Screen recording DataScreen Recorder screen casting process only transfers the screen data, it does not actively save the data, nor does it upload any data to third parties. The app will only save the screen data to the Movies folder if the user actively clicks the record button during the casting process.Screen Recorder requires a local network to make the device discoverable by other devices. Once the device is connected, the operation is safe and local and does not require a network. Users can even turn off the network for screen casting and recording. The screen data is not shared elsewhere. Information Security","link":"/2023/06/06/Screen-Recorder-Privacy-policy/"},{"title":"Screen Recorder User Agreement","text":"30 September, 2022 Dear users, welcome to use Screen Recorder and related services! To better provide services to you, please carefully read the “ Screen Recorder User Service Agreement” (hereinafter referred to as the “This Agreement”) “.This Agreement is an agreement between you and the Screen Recorder operator for your use of the Screen Recorder and related services.Before you begin to use Screen Recorder software and related services, please carefully read and fully understand this Agreement (you confirm that before you register to use Screen Recorder software and related services, you shall have the civil capacity of the laws of the People’s Republic of China to suit your behavior. If you do not have the foregoing capacity for civil conduct corresponding to your conduct, you and your guardian shall bear all the consequences arising therefrom in accordance with the law.), In particular, terms related to exempting or restricting liability, licensing of rights and the use of information, terms for agreeing to open and use special individual services, application of laws and dispute resolution terms, etc.Among them, important content such as exemption or restriction of liability clause will be prompted in bold form, you should focus on reading. If you are under the age of 18, please read and fully understand this Agreement carefully, accompanied by your legal guardian, and use the 「Screen Recorder」 **software and related services with the consent of your legal guardian.****If you are a user outside of the Chinese mainland Region, you must enter into or perform this Agreement to also comply with the laws of the country or region to which you belong and / or belong.**If you do not agree to the full content of this Agreement, this will make Screen Recorder Operator unable to provide you with the complete products and services, and you may choose to stop the use.If you independently choose to agree to or use the Screen Recorder software and related services, you are deemed to have fully understood this Agreement and have agreed to be binding as a party to this Agreement. 1. Scope of application This Agreement is an agreement between you and the Screen Recorder operator for you to download, install, register, login, use the Screen Recorder software, and obtain the relevant services provided by the Screen Recorder software. If you know and agree to accept the relevant Services, it will be deemed that the relevant rights and obligations are also subject to this Agreement. “User” means all users who directly or indirectly acquire and use the Screen Recorder software and related services, including natural persons, legal persons and other organizations, etc. As “User” or “You” in this Agreement. The Screen Recorder is a client application legally owned and operated by Screen Recorder Operator with the name of Screen Recorder . Screen Recorder Operator has the right to unilaterally change the application (including but not limited to name change, new addition, etc.). This Agreement also includes the relevant agreements, rules and other contents concerning the Screen Recorder software and related services already issued and possibly continuously issued by Screen Recorder Operator (including the Screen Recorder Privacy Policy). Once the above content is officially released, Screen Recorder Operator will remind you to read it in an appropriate manner (website announcement, system notice, etc.). The foregoing relevant agreements and rules constitute an integral part of this Agreement, and you shall also comply with them. 2. Service content The specific content of Screen Recorder service is provided by Screen Recorder operator according to the actual situation, and Screen Recorder operator has the right to upgrade or otherwise adjust the service or product form it provides, and will update the page / inform users in time. You agree that Screen Recorder may send you advertising, promotion or promotional information (including commercial and non-commercial information) by itself or by third-party advertisers in the course of providing the Services in a manner and scope changed without special notice to you. Screen Recorder may provide you with a function or channel to choose to stop accepting advertising information, but at no time shall you block filtering advertising information without an express agreement or by Screen Recorder . Screen Recorder in accordance with the law of the advertisers, you shall judge the authenticity of the advertising information and responsible for their judgment, in addition to the law, # a p p according to the advertisement information transactions or the loss or damage, _ n a m e # shall not be liable. Use the service You shall be responsible for your use of Screen Recorder and related services, shall not use Screen Recorder to disrespect other users, and shall not publish or spread acts that affect other user experience, harm “screen +” security or damage other rights and interests, including but not limited to the following acts: Any reverse engineering, reverse assembly, compile, or other attempt to discover or obtain the source code of this software. Use any plug-ins, plug-ins, systems and other third party tools to damage Screen Recorder , affect Screen Recorder , without our authorization or permission. Using or endangering network security against Screen Recorder and related services. In violation of laws and regulations, this Agreement, relevant rules of Screen Recorder Operator and other acts that infringe upon the legitimate rights and interests of others. 3.2 Using the Screen Recorder software and related services, you can obtain the Screen Recorder client application or access the Screen Recorder related website by pre-installation and authorized third-party downloads. If you do not obtain the software from Screen Recorder Operator or a third party authorized by Screen Recorder Operator, Screen Recorder Operator cannot guarantee that the unofficial version of the Screen Recorder software can be used normally, and the loss you suffer is unrelated to Screen Recorder Operator. 3.3 Screen Recorder Operator may have developed different application software versions for different terminal devices, and you should obtain, download, and install the appropriate versions according to the actual device status. 3.4 You can use the Screen Recorder software and related services or update the Screen Recorder version on your own needs, or if you no longer need to use the Screen Recorder software and related services. 3.5 In order to better improve the user experience and services, Screen Recorder Operator will irregularly provide software updates or changes (including but not limited to software modification, upgrade, function enhancement, developing new services, software replacement, etc.). In order to ensure the security of Screen Recorder software and related services and improve user services, after the software and related services updates or some service content updates, if possible, Screen Recorder Operator will prompt users by including but not limited to system prompts, announcements, site letter, and users have the right to choose to accept the updated version or service, if users do not accept, some functions will be restricted or can not continue to use. 3.6 You shall not, except with express prior written authorization from Screen Recorder Operator, use the Screen Recorder software and related services, including, without limitation, unauthorized access or use of adaptation, copy, dissemination, vertical search, mirror or transaction. 3.7 You understand that when using Screen Recorder software and related services, you need to prepare your own terminal devices (such as computers, mobile phones and other devices) related to the software and related services. Once you open Screen Recorder software in your terminal devices, you are considered using Screen Recorder software and related services. To fully realize the full functions of Screen Recorder , you may need to network its terminal devices, and you understand that you will bear the costs (e. g., traffic fees, Internet fees, etc.). 3.8 Screen Recorder Operator licenses your personal, revocable, nontransferable, non-transferable, exclusive and non-commercial legal use of the Screen Recorder software and related services. All other rights not expressly authorized by this Agreement shall remain reserved by Screen Recorder Operator, and you shall obtain separate written permission from Screen Recorder Operator, and your failure to exercise any of the aforementioned rights shall not constitute a waiver of such rights. 3.9 Users shall consciously use Screen Recorder and related services to abide by the Constitution, laws, regulations and public order, and shall not use Screen Recorder and related services to produce, copy, release and disseminate the following contents: (1) Opposing the basic principles set out in the Constitution; (2) Harm national security, disclosing state secrets, subverting state power or undermining state unity; (3) Damaging the national honor and interests; (4) Initing ethnic hatred or discrimination or undermining ethnic unity; (5) Disrupting state religious policies and promoting evil cults and feudal superstition; (6) Spread rumors, disturbing social order or destroying social stability; (7) Spreading obscenity, pornography, gambling, violence, murder, terror, or abetting crimes; (8) Insulting or defaming others, or infringing upon the legitimate rights and interests of others; (9) Other information that violates laws, regulations, policies, public order and good customs, interferes with the normal operation of Screen Recorder , or infringes upon the legitimate rights and interests of other users or third parties. Screen Recorder Operator has the right to review and supervise your use of Screen Recorder , and if you violate the above provisions, Screen Recorder Operator to correct and directly take all necessary measures (including but not limited to suspend or terminate your use of Screen Recorder ) to mitigate the impact of your misconduct. Relevant records will be kept for suspected violations of laws and regulations, and reported to relevant competent departments in accordance with the law, and cooperate with relevant competent departments for adjustment. 3.10 If you find any violation of your rights in the Screen Recorder software, please notify Screen Recorder Operator immediately through the email # feedback email # to provide prima facie evidence of the fact that you have relevant rights. Screen Recorder Operator will handle your complaint in a timely manner in accordance with local laws. 3.11 You must comply with all of the policies provided in the Service. Do not misuse our services. For example, do not interfere with our services or try to access them using methods other than the interfaces and instructions we provide. You can only use our services to the extent permitted by law (including applicable export and reexport control laws and regulations). If you do not comply with our terms or policies, or if we are investigating suspicious misconduct, we may suspend or stop providing services to you. Using our services does not let you own any intellectual property in our services or what you access. You may not use any content in the Service unless you are licensed by the relevant content owner or otherwise licensed by law. These terms do not grant you the right to use any trademarks or marks used in our Services. Do not delete, hide, or change any legal statements that appear on or along with our Services. Our service shows something that does not belong to Screen Recorder . The content is given full responsibility by the publishing entity. We may review the relevant content to determine whether it is illegal or violates our policy; we may delete or refuse to display it if we can reasonably believe that it violates our policy or is a violation. However, this does not mean that we will necessarily review the content, so do not take it for granted that we are reviewing it. Some of our services are available on mobile devices. Do not distract yourself and violate traffic or safety laws when using such services. 4. Privacy and Copyright protection The Screen Recorder Privacy Policy of Screen Recorder describes how we will handle your personal data and protect your privacy when you are using our services. Using our services means that you agree that Screen Recorder can use your personal data in accordance with our Privacy Policy., User’s personal information protection 4.1 We attach great importance to the protection of user information, and the protection of user personal information is one of the basic principles of Screen Recorder Operator. Screen Recorder Operator works to the protection of the user’s personal information (i. e., information that can be identified independently or in combination with other information). 4.2 In using the Screen Recorder software and related services, you may need to provide your personal information (including but not limited to your name, phone number, location information, equipment information, etc.), so that Screen Recorder Operator can provide you with better services and corresponding technical support. You understand and agree that Screen Recorder Operator has the right to collect, use (including commercial and cooperative use), store and share your personal information, subject compliance, this Agreement and the Screen Recorder Privacy Policy, and we will protect your right to browse, modify, delete relevant personal information and withdraw your consent in accordance with the law. 4.3 You may browse and modify your personally identifiable information at any time, and you understand and agree that you may not modify the initial registration information and other verification information provided at registration for the purposes of security and identification (such as account or password retrieval complaint service, etc.). 4.4 Screen Recorder Operator will use the security technology and other security measures matching the Screen Recorder software and related services, and establish a sound management system to protect your personal information and prevent your information from being improperly used or unauthorized access, use or leakage. 4.5 Screen Recorder Operator will not disclose your personal information to any company, organization or individual other than it without your consent, except in the following circumstances: (1) Get your explicit authorized consent in advance; (2) You share, transfer or disclose the agreement to other companies, organizations and individuals by yourself; (3) Directly related to national security, national defense security, public security, public health and public interests; (4) Disclosure or provision if necessary in accordance with the requirements of applicable laws and regulations and mandatory administrative and judicial requirements, or directly related to criminal investigation, prosecution, trial and execution of judgment. On the premise of complying with the laws and regulations, when Screen Recorder Operatorreceives the aforesaid request for disclosure, Screen Recorder Operator will require the other party to issue the corresponding legal documents, such as a summons or a letter of investigation. Screen Recorder Operator will review all the requests carefully to ensure that they have a legal basis and are limited to the data that the administrative and judicial departments have a legal right to obtain for specific investigative purposes; (5) To the scope permitted by laws and regulations, it is necessary to maintain the safe and stable operation of Screen Recorder other users, companies and their affiliated companies, controlling their lives and property or rights and protection products or services, such as, finding, preventing and dealing with illegal activities such as fraud and reducing credit risks (excluding disclosing or providing personal information for profit in violation of the commitments made in this Agreement); (6) Personal information from the legally publicly disclosed information, such as legal news reports, government information disclosure and other channels; (7) Other circumstances as stipulated by laws and regulations. 4.6 Please pay attention not to disclose your property account, bank cards, credit cards, third-party payment account and other important information in using Screen Recorder software and related services. Otherwise, you will bear any losses caused thereby. 4.7 Considering that the Screen Recorder software and related services may include or link to third parties providing information or other services (including websites). You are aware and understand that third parties operating such services may require you for personal information. In particular, Screen Recorder Operator reminds you that you need to carefully read their user agreements, privacy policies, and other relevant terms, to properly protect your personal information, and to provide it only to such third parties, if necessary. This Agreement (and other agreements and rules related to the Screen Recorder software and related services (including but not limited to the Screen Recorder Privacy Policy) shall not apply to any service provided by any third party, and Screen Recorder Operator shall not be liable for any consequences that may result from any third party’s use of the personal information provided by you. For more information on user personal information protection, see the Screen Recorder Privacy Policy 5. Content responsibility Certain of our services allow you to upload, submit, store, send, or receive content. You acknowledge that all information, data, text, software, music, sound, photos, graphics, videos, video, messages, tags and other materials (the “Content”) accessed through the Screen Recorder service, whether publicly published or privately transmitted, are accountable by the content provider. You retain ownership of any intellectual property rights held in the Content. In short, what you belong to still belongs to you. You can find details about how Screen Recorder uses and stores the content in the Privacy Policy or rider of the relevant Services. If you submit feedback or advice on your services, we may take advantage, but assume no obligation to you. 6. User behavior requirements You shall be responsible for your use of the Products and related Services and, unless permitted by law or with prior written permission by Screen Recorder Operator, using the Screen Recorder Software shall not be: 6.1 Any computer network security harm is done by using or acting against the Screen Recorder software and related services, including but not limited to: (1) Activities that endanger network security, such as illegally invading others ‘network, interfering with the normal functions of others’ network, and stealing network data; (2) Provide programs and tools specialized for invading the network, interfering with the normal functions and protective measures of the network, stealing the network data and other activities endangering the network security; (3) Those who knowingly engage in activities endangering network security shall provide technical support, advertising promotion, payment and settlement and other assistance to them (4) Use the unauthorized data or enter the unauthorized server / account; (5) Enter the public computer network or other people’s computer systems without permission and delete, modify or increase the stored information; (6) Attempt to explore, scan, or test the weaknesses of the Screen Recorder system or the network, or conduct other acts that destroy the network security, without permission; (7) Attempt to interfere with or destroy the normal operation of the Screen Recorder system, intentionally spread malicious programs or viruses, and other behaviors that interfere with the normal network information services; (8) Fake the TCP / IP package name or partial name. 6.2 Violations of laws and regulations, this Agreement, relevant rules of Screen Recorder Operator and other acts infringing upon the legitimate rights and interests of others. In any event, if Screen Recorder Operator reasonably believes that any of your actions violates or may violate the above provisions, Screen Recorder Operator may independently judge and deal with it, and shall at any time be entitled to terminate the service to users with any prior notice. 7 Modification and termination of services, change, interruption, and termination of services 7.1 You understand and agree that the Screen Recorder software and related services are available according to the existing technology and conditions. Screen Recorder Operator will do our best to serve you to ensure continuity and security. You understand that Screen Recorder Operator can not always foresee and prevent legal, technical and other risks, including but not limited to force majeure, virus, Trojan, hacker attacks, system instability, third-party service defects and other security problems may lead to service interruption, data loss and other loss and risk, the situation including but not limited to: (1) During the shutdown, maintenance, upgrade and adjustment of the system as announced by Screen Recorder ; (2) Data transmission of telecommunication communication or equipment; (3) The Screen Recorder system failure fails due to typhoon, earthquake, force majeure factors such as tsunami, flood, power failure, war, terrorist attack and government control; (4) Service interruption or delay caused by hacking and hacker attacks, technical adjustment or failure of the telecom department, website upgrade, and problems of related third parties, etc. 7.2 You understand and agree that Screen Recorder Operator, in order to serve the needs of the overall operation, has the right to modify, interrupt, suspend or terminate the Screen Recorder software and related services after the announcement, without being responsible or assuming any liability to the User. 7.3 It is very important that we think you have ownership of your data and retain access to such data. If we stop a service, we will reasonably possible reasonable advance notice and give the user the opportunity to remit information from the service. 8. Advertising 8.1 You understand and agree that during your use of Screen Recorder software and related services, Screen Recorder Operator may push relevant information, advertising or branding services to you, and that Screen Recorder Operator will display Screen Recorder and related services and / or third party suppliers, partners’ commercial advertising, promotion or information (including commercial or non-business information) in Screen Recorder and related services. 8.2 If you do not agree to the advertisement, you shall have the right to close the advertisement message. 8.3 If Screen Recorder Operator performs its advertising and promotion obligations in accordance with the law, you shall judge the authenticity and reliability of the advertising or promotion information and be responsible for your own judgment. Except as expressly stipulated by laws and regulations, you shall be liable for the purchase or transaction or damage or losses caused by the above-mentioned information, and Screen Recorder Operator shall not be liable. 9 Intellectual property rights 9.1 The intellectual property rights of the content (including but not limited to interface design, software, technology, programs, web pages, text, pictures, images, audio, video, charts, electronic documents, etc.) provided in the Screen Recorder software and related services are owned by Screen Recorder Operator. The software copyright, patent rights and other intellectual property rights relied on by Screen Recorder Operator when providing Screen Recorder and related services are all owned by Screen Recorder Operator. Without your prior written consent, you may not use, cover, or alter, copyright notices, trademarks, or other declarations of rights, display, use or otherwise in any way, including, without limitation, monitor, copy, disseminate, display, mirror, upload or download Screen Recorder software and related services through any robot, “spider” or other programs or equipment. If you use the above trademarks of Screen Recorder Operator or make representations and cause losses to Screen Recorder Operator or others due to your violation of this Agreement, you will bear all the legal liabilities. 9.2 Screen Recorder Operator provides technical support for the development and operation of Screen Recorder , and has all rights to all data and information generated during the development and operation of Screen Recorder software and related services. 10. Guarantees and Disclaimers We will fulfill our commercially reasonable level of skills and care when providing our services and hope you will enjoy using them. But there are some matters about services that we cannot promise. The Screen Recorder makes no specific commitment to the Services, except as is expressly specified in this clause or rider. For example, we make no commitment to the content of the service, the specific functionality of the service, or its reliability, availability, or the ability to meet your needs. The service is provided “as is”. 10.1 You understand and agree that the Screen Recorder software and related services may be affected or disturbed by a variety of factors, and Screen Recorder Operator does not guarantee (including but not limited to) that: 10.1.1 Screen Recorder Operator is fully suitable for the use requirements of users; 10.1.2 Screen Recorder Operator is not disturbed, timely, safe, reliable or erroneous; any software, service or other materials obtained by users of Screen Recorder Operator through Screen Recorder Operator meet its expectations; 10.1.3 Any errors in the software will be corrected. 10.2 For suspected borrowing or other property-related network information, account password, advertising or promotion information, etc., users please cautious and their own judgment, based on the reason of the profit, business reputation, data or other tangible or intangible losses, without any direct, indirect, incidental, special, derivative or punitive liability. 10.3 The user understands and agrees that in the use of Screen Recorder software and related services, it may encounter force majeure (objective events that are unforeseeable, insurmountable and unavoidable), including but not limited to government actions, natural disasters, network causes, attacks, hacker attacks, war or any other similar events. In case of force majeure, Screen Recorder Operator will try to repair it in time, but due to the force majeure caused losses to the user, the user agrees that Screen Recorder Operator will not be liable. 10.4 Screen Recorder Operator obtains the right to deal with the illegal contents according to this Agreement. This right does not constitute the obligation or commitment of Screen Recorder Operator. Screen Recorder Operator cannot guarantee to timely discover the illegal acts or deal with them accordingly. 10.5 The User clearly understands and agrees that: with respect to the Services herein, Screen Recorder Operator shall not provide any express or implied guarantee or conditions, including but not limited to commercial merchantability, applicability for specific purposes, etc. Your use of the Software and related Services must bear its own risks. 10.6 Users clearly understand and agree that this agreement is in safeguard compliance with national laws and regulations, maintain public order good customs, protect the legitimate rights and interests of others, Screen Recorder Operatorwithin the scope of ability to judge in accordance with the relevant laws and regulations, but does not guarantee Screen Recorder Operator judgment completely consistent with the judicial organs, administrative organs, such as the consequences of the users have understood and agreed to bear. 1*1. Responsibility for services (limitation of liability)* You understand and agree that Screen Recorder is not liable for loss of profit, lost income or data, financial loss, or consequential, special, consequential, exemplary, or punitive damages to the extent permitted by law. To the extent permitted by law, Screen Recorder ‘s full liability for any claim (including any implied warranty) under this section is limited to the amount you pay us for your use of the Service (or we may choose to provide you again). In all cases, Screen Recorder is not liable for any loss or damage which could not be reasonably foreseen. 1*2. Breach settlement* 12.1 For any third-party complaint or litigation claim arising from your violation of this Agreement or other terms of Service, you shall bear all your own legal liabilities. If Screen Recorder Operator makes compensation to any third party or suffers a state organ punishment due to your violation or breach of contract, you shall also fully compensate Screen Recorder Operator for all the losses suffered thereby. 12.2 Screen Recorder Operator respects and protects the legal rights and interests of intellectual property rights, reputation rights, name rights, privacy rights and portrait rights of legal persons and citizens. You shall guarantee that the information produced, copied and disseminated by using Screen Recorder and related services shall not infringe the intellectual property rights, reputation rights, name rights, name rights, privacy rights and portrait rights of any third party. You shall bear all legal liabilities for all claims made by a third party; if Screen Recorder Operator suffers losses (including economic and goodwill losses) caused by your infringement, you shall also fully compensate Screen Recorder Operator for all losses incurred. 12.3 You shall reasonably and legally use Screen Recorder and related services to the scope permitted by laws and regulations, and shall not produce, copy, publish and disseminate information without using Screen Recorder , nor for business purposes or illegal purposes. For such infringement on the legitimate rights and interests of any third party, you shall bear full legal liability to compensate Screen Recorder Operator for any losses (including economic, goodwill and other losses) caused by your infringement. 1*3. Regarding this clause* In case of any conflict between this clause and the rider, the rider shall prevail. This clause restricts the relationship between Screen Recorder and you and does not create any third-party beneficial rights. If you fail to comply with this clause and we fail to act immediately, it does not mean that we waive any rights that we may have (e. g., to act in the future). If one provision is not enforceable, it will not affect the force of the others. 13.1 The establishment, effect, performance, interpretation and dispute settlement of this Agreement shall be governed by the mainland laws of the People’s Republic of China. If any provision of this Agreement is invalid in conflict with the mainland laws of the People’s Republic of China, these provisions shall be as close as possible to the provisions of this Agreement and the other provisions of this Agreement shall still have full effect and effect. 13.2 This Agreement and its related acts are governed by and construed by the laws of the People’s Republic of China. Any dispute arising from you and Screen Recorder over this Service, this User Agreement or other related matters shall be settled through friendly negotiation first. If the negotiation fails, you agree to submit the dispute or dispute to the jurisdiction of the people’s court with jurisdiction of the place where this Agreement is signed. 13.3 According to the development of the Internet and the changes of relevant laws, regulations and normative documents, or for business development needs, Screen Recorder Operator has the right to modify or change the terms of this Agreement. In the event of changes in the contents of this Agreement, Screen Recorder Operator will directly publish the revised agreement content in the Screen Recorder application, which shall be deemed as Screen Recorder has notified the users to modify the content.The Screen Recorder can also use the system notification or private message transmission method to prompt users of the modification of the agreement terms, service changes, or other important matters. If not agreeing to the Screen Recorder changes to the relevant terms of this Agreement, the user has the right to and shall stop using the Screen Recorder . If the user continues to use the Screen Recorder , the user is deemed to accept changes to the Screen Recorder related terms of this Agreement. 13.4 The title contained in this Agreement is provided for convenience and reading only, and does not affect the meaning or interpretation of any provision contained in this Agreement. 13.5 Both You and Screen Recorder Operator are separate entities, and in no event shall this Agreement constitute any express or implied guarantee or condition of Screen Recorder Operator to the User, nor shall it constitute an agency, partnership, joint venture or employment relationship between the parties. 13.6 Screen Recorder Operator shall set up public complaint and report channels.Users can complain and report all kinds of illegal behaviors, illegal dissemination activities, illegal and harmful information to colorshenry@hotmail.com at any time. We will accept and handle user complaints and reports within 15 working days, in order to jointly create a clean and upright cyberspace. 13.7 The copyright of this Agreement is owned by Screen Recorder Operator, and Screen Recorder Operator reserves all rights to interpret and modify it.","link":"/2023/07/20/Screen-Recorder-User-Agreement/"}],"tags":[{"name":"Privacy","slug":"Privacy","link":"/tags/Privacy/"}],"categories":[{"name":"Other","slug":"Other","link":"/categories/Other/"}],"pages":[]}